sessions/F03-market-open-connection-storm/results/raw/diag-fixed-prealloc200-k6.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: /scripts/spike.js
        output: -

     scenarios: (100.00%) 1 scenario, 900 max VUs, 1m0s max duration (incl. graceful stop):
              * market_open: Up to 400.00 iterations/s for 30s over 3 stages (maxVUs: 200-900, gracefulStop: 30s)


running (0m00.8s), 004/200 VUs, 19 complete and 0 interrupted iterations
market_open   [   3% ] 004/200 VUs  00.8s/30s  061.32 iters/s

running (0m01.8s), 007/200 VUs, 118 complete and 0 interrupted iterations
market_open   [   6% ] 007/200 VUs  01.8s/30s  141.70 iters/s

running (0m02.8s), 010/200 VUs, 296 complete and 0 interrupted iterations
market_open   [   9% ] 010/200 VUs  02.8s/30s  221.45 iters/s

running (0m03.8s), 010/200 VUs, 558 complete and 0 interrupted iterations
market_open   [  13% ] 010/200 VUs  03.8s/30s  301.60 iters/s

running (0m04.8s), 017/200 VUs, 892 complete and 0 interrupted iterations
market_open   [  16% ] 017/200 VUs  04.8s/30s  381.47 iters/s

running (0m05.8s), 028/200 VUs, 1279 complete and 0 interrupted iterations
market_open   [  19% ] 028/200 VUs  05.8s/30s  400.00 iters/s

running (0m06.8s), 050/200 VUs, 1657 complete and 0 interrupted iterations
market_open   [  23% ] 050/200 VUs  06.8s/30s  400.00 iters/s

running (0m07.8s), 012/200 VUs, 2096 complete and 0 interrupted iterations
market_open   [  26% ] 012/200 VUs  07.8s/30s  400.00 iters/s

running (0m08.8s), 020/200 VUs, 2487 complete and 0 interrupted iterations
market_open   [  29% ] 020/200 VUs  08.8s/30s  400.00 iters/s

running (0m09.8s), 039/200 VUs, 2869 complete and 0 interrupted iterations
market_open   [  33% ] 039/200 VUs  09.8s/30s  400.00 iters/s

running (0m10.8s), 030/200 VUs, 3277 complete and 0 interrupted iterations
market_open   [  36% ] 030/200 VUs  10.8s/30s  400.00 iters/s

running (0m11.8s), 071/200 VUs, 3631 complete and 0 interrupted iterations
market_open   [  39% ] 071/200 VUs  11.8s/30s  400.00 iters/s

running (0m12.8s), 139/200 VUs, 3968 complete and 0 interrupted iterations
market_open   [  43% ] 139/200 VUs  12.8s/30s  400.00 iters/s

running (0m13.8s), 071/200 VUs, 4436 complete and 0 interrupted iterations
market_open   [  46% ] 071/200 VUs  13.8s/30s  400.00 iters/s

running (0m14.8s), 052/200 VUs, 4855 complete and 0 interrupted iterations
market_open   [  49% ] 052/200 VUs  14.8s/30s  400.00 iters/s

running (0m15.8s), 013/200 VUs, 5294 complete and 0 interrupted iterations
market_open   [  53% ] 013/200 VUs  15.8s/30s  400.00 iters/s

running (0m16.8s), 024/200 VUs, 5684 complete and 0 interrupted iterations
market_open   [  56% ] 024/200 VUs  16.8s/30s  400.00 iters/s

running (0m17.8s), 012/200 VUs, 6095 complete and 0 interrupted iterations
market_open   [  59% ] 012/200 VUs  17.8s/30s  400.00 iters/s

running (0m18.8s), 011/200 VUs, 6497 complete and 0 interrupted iterations
market_open   [  63% ] 011/200 VUs  18.8s/30s  400.00 iters/s

running (0m19.8s), 010/200 VUs, 6897 complete and 0 interrupted iterations
market_open   [  66% ] 010/200 VUs  19.8s/30s  400.00 iters/s

running (0m20.8s), 010/200 VUs, 7297 complete and 0 interrupted iterations
market_open   [  69% ] 010/200 VUs  20.8s/30s  400.00 iters/s

running (0m21.8s), 010/200 VUs, 7697 complete and 0 interrupted iterations
market_open   [  73% ] 010/200 VUs  21.8s/30s  400.00 iters/s

running (0m22.8s), 012/200 VUs, 8095 complete and 0 interrupted iterations
market_open   [  76% ] 012/200 VUs  22.8s/30s  400.00 iters/s

running (0m23.8s), 010/200 VUs, 8498 complete and 0 interrupted iterations
market_open   [  79% ] 010/200 VUs  23.8s/30s  400.00 iters/s

running (0m24.8s), 011/200 VUs, 8896 complete and 0 interrupted iterations
market_open   [  83% ] 011/200 VUs  24.8s/30s  400.00 iters/s

running (0m25.8s), 033/200 VUs, 9250 complete and 0 interrupted iterations
market_open   [  86% ] 033/200 VUs  25.8s/30s  338.59 iters/s

running (0m26.8s), 010/200 VUs, 9572 complete and 0 interrupted iterations
market_open   [  89% ] 010/200 VUs  26.8s/30s  258.46 iters/s

running (0m27.8s), 008/200 VUs, 9792 complete and 0 interrupted iterations
market_open   [  93% ] 008/200 VUs  27.8s/30s  178.21 iters/s

running (0m28.8s), 005/200 VUs, 9934 complete and 0 interrupted iterations
market_open   [  96% ] 005/200 VUs  28.8s/30s  098.39 iters/s

running (0m29.8s), 001/200 VUs, 9996 complete and 0 interrupted iterations
market_open   [  99% ] 001/200 VUs  29.8s/30s  019.90 iters/s


  █ TOTAL RESULTS 

    checks_total.......: 39996  1333.141612/s
    checks_succeeded...: 25.00% 9999 out of 39996
    checks_failed......: 75.00% 29997 out of 39996

    ✗ 200 정상 응답
      ↳  42% — ✓ 4294 / ✗ 5705
    ✗ 503 부하 차단(의도된 흘려보냄)
      ↳  57% — ✓ 5705 / ✗ 4294
    ✗ 500 서버오류(커넥션 타임아웃)
      ↳  0% — ✓ 0 / ✗ 9999
    ✗ 응답 못 받음(status 0)
      ↳  0% — ✓ 0 / ✗ 9999

    CUSTOM
    cnt_200........................: 4294   143.127065/s
    cnt_503........................: 5705   190.158338/s
    dur_200_ok.....................: avg=99.13ms min=50.9ms   med=59.07ms max=891.2ms  p(90)=196.02ms p(95)=271.15ms
    dur_503_shed...................: avg=70.08ms min=521.12µs med=25.59ms max=694.86ms p(90)=203.41ms p(95)=305.43ms

    HTTP
    http_req_duration..............: avg=82.55ms min=521.12µs med=53.48ms max=891.2ms  p(90)=200.1ms  p(95)=293.98ms
      { expected_response:true }...: avg=99.13ms min=50.9ms   med=59.07ms max=891.2ms  p(90)=196.02ms p(95)=271.15ms
    http_req_failed................: 57.05% 5705 out of 9999
    http_reqs......................: 9999   333.285403/s

    EXECUTION
    iteration_duration.............: avg=83.08ms min=636.32µs med=53.84ms max=891.49ms p(90)=201.2ms  p(95)=294.31ms
    iterations.....................: 9999   333.285403/s
    vus............................: 1      min=1            max=139
    vus_max........................: 200    min=200          max=200

    NETWORK
    data_received..................: 1.5 MB 52 kB/s
    data_sent......................: 750 kB 25 kB/s



running (0m30.0s), 000/200 VUs, 9999 complete and 0 interrupted iterations
market_open ✓ [ 100% ] 000/200 VUs  30s  006.32 iters/s